Model: "model"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            [(8, 128, 416, 3)]   0                                            
__________________________________________________________________________________________________
conv1a (Conv2D)                 (8, 128, 416, 32)    4736        input_1[0][0]                    
__________________________________________________________________________________________________
conv1b (Conv2D)                 (8, 64, 208, 32)     50208       conv1a[0][0]                     
__________________________________________________________________________________________________
conv2a (Conv2D)                 (8, 64, 208, 64)     51264       conv1b[0][0]                     
__________________________________________________________________________________________________
conv2b (Conv2D)                 (8, 32, 104, 64)     102464      conv2a[0][0]                     
__________________________________________________________________________________________________
conv3a (Conv2D)                 (8, 32, 104, 128)    73856       conv2b[0][0]                     
__________________________________________________________________________________________________
conv3b (Conv2D)                 (8, 16, 52, 128)     147584      conv3a[0][0]                     
__________________________________________________________________________________________________
conv4a (Conv2D)                 (8, 16, 52, 256)     295168      conv3b[0][0]                     
__________________________________________________________________________________________________
conv4b (Conv2D)                 (8, 8, 26, 256)      590080      conv4a[0][0]                     
__________________________________________________________________________________________________
conv5a (Conv2D)                 (8, 8, 26, 512)      1180160     conv4b[0][0]                     
__________________________________________________________________________________________________
conv5b (Conv2D)                 (8, 4, 13, 512)      2359808     conv5a[0][0]                     
__________________________________________________________________________________________________
conv6a (Conv2D)                 (8, 4, 13, 512)      2359808     conv5b[0][0]                     
__________________________________________________________________________________________________
conv6b (Conv2D)                 (8, 2, 7, 512)       2359808     conv6a[0][0]                     
__________________________________________________________________________________________________
conv7a (Conv2D)                 (8, 2, 7, 512)       2359808     conv6b[0][0]                     
__________________________________________________________________________________________________
conv7b (Conv2D)                 (8, 1, 4, 512)       2359808     conv7a[0][0]                     
__________________________________________________________________________________________________
up7_sample (UpSampling2D)       (8, 2, 8, 512)       0           conv7b[0][0]                     
__________________________________________________________________________________________________
up7_conv1 (Conv2D)              (8, 2, 8, 512)       2359808     up7_sample[0][0]                 
__________________________________________________________________________________________________
up7_resize (Lambda)             (8, 2, 7, 512)       0           up7_conv1[0][0]                  
__________________________________________________________________________________________________
up7_concat (Concatenate)        (8, 2, 7, 1024)      0           up7_resize[0][0]                 
                                                                 conv6b[0][0]                     
__________________________________________________________________________________________________
up7_conv2 (Conv2D)              (8, 2, 7, 512)       4719104     up7_concat[0][0]                 
__________________________________________________________________________________________________
up6_sample (UpSampling2D)       (8, 4, 14, 512)      0           up7_conv2[0][0]                  
__________________________________________________________________________________________________
up6_conv1 (Conv2D)              (8, 4, 14, 512)      2359808     up6_sample[0][0]                 
__________________________________________________________________________________________________
up6_resize (Lambda)             (8, 4, 13, 512)      0           up6_conv1[0][0]                  
__________________________________________________________________________________________________
up6_concat (Concatenate)        (8, 4, 13, 1024)     0           up6_resize[0][0]                 
                                                                 conv5b[0][0]                     
__________________________________________________________________________________________________
up6_conv2 (Conv2D)              (8, 4, 13, 512)      4719104     up6_concat[0][0]                 
__________________________________________________________________________________________________
up5_sample (UpSampling2D)       (8, 8, 26, 512)      0           up6_conv2[0][0]                  
__________________________________________________________________________________________________
up5_conv1 (Conv2D)              (8, 8, 26, 256)      1179904     up5_sample[0][0]                 
__________________________________________________________________________________________________
up5_concat (Concatenate)        (8, 8, 26, 512)      0           up5_conv1[0][0]                  
                                                                 conv4b[0][0]                     
__________________________________________________________________________________________________
up5_conv2 (Conv2D)              (8, 8, 26, 256)      1179904     up5_concat[0][0]                 
__________________________________________________________________________________________________
up4_sample (UpSampling2D)       (8, 16, 52, 256)     0           up5_conv2[0][0]                  
__________________________________________________________________________________________________
up4_conv1 (Conv2D)              (8, 16, 52, 128)     295040      up4_sample[0][0]                 
__________________________________________________________________________________________________
up4_concat (Concatenate)        (8, 16, 52, 256)     0           up4_conv1[0][0]                  
                                                                 conv3b[0][0]                     
__________________________________________________________________________________________________
up4_conv2 (Conv2D)              (8, 16, 52, 128)     295040      up4_concat[0][0]                 
__________________________________________________________________________________________________
pred4_conv (Conv2D)             (8, 16, 52, 1)       1153        up4_conv2[0][0]                  
__________________________________________________________________________________________________
up3_sample (UpSampling2D)       (8, 32, 104, 128)    0           up4_conv2[0][0]                  
__________________________________________________________________________________________________
pred4_scale (Lambda)            (8, 16, 52, 1)       0           pred4_conv[0][0]                 
__________________________________________________________________________________________________
up3_conv1 (Conv2D)              (8, 32, 104, 64)     73792       up3_sample[0][0]                 
__________________________________________________________________________________________________
pred4_resize (Lambda)           (8, 32, 104, 1)      0           pred4_scale[0][0]                
__________________________________________________________________________________________________
up3_concat (Concatenate)        (8, 32, 104, 129)    0           up3_conv1[0][0]                  
                                                                 conv2b[0][0]                     
                                                                 pred4_resize[0][0]               
__________________________________________________________________________________________________
up3_conv2 (Conv2D)              (8, 32, 104, 64)     74368       up3_concat[0][0]                 
__________________________________________________________________________________________________
pred3_conv (Conv2D)             (8, 32, 104, 1)      577         up3_conv2[0][0]                  
__________________________________________________________________________________________________
up2_sample (UpSampling2D)       (8, 64, 208, 64)     0           up3_conv2[0][0]                  
__________________________________________________________________________________________________
pred3_scale (Lambda)            (8, 32, 104, 1)      0           pred3_conv[0][0]                 
__________________________________________________________________________________________________
up2_conv1 (Conv2D)              (8, 64, 208, 32)     18464       up2_sample[0][0]                 
__________________________________________________________________________________________________
pred3_resize (Lambda)           (8, 64, 208, 1)      0           pred3_scale[0][0]                
__________________________________________________________________________________________________
up2_concat (Concatenate)        (8, 64, 208, 65)     0           up2_conv1[0][0]                  
                                                                 conv1b[0][0]                     
                                                                 pred3_resize[0][0]               
__________________________________________________________________________________________________
up2_conv2 (Conv2D)              (8, 64, 208, 32)     18752       up2_concat[0][0]                 
__________________________________________________________________________________________________
pred2_conv (Conv2D)             (8, 64, 208, 1)      289         up2_conv2[0][0]                  
__________________________________________________________________________________________________
up1_sample (UpSampling2D)       (8, 128, 416, 32)    0           up2_conv2[0][0]                  
__________________________________________________________________________________________________
pred2_scale (Lambda)            (8, 64, 208, 1)      0           pred2_conv[0][0]                 
__________________________________________________________________________________________________
up1_conv1 (Conv2D)              (8, 128, 416, 16)    4624        up1_sample[0][0]                 
__________________________________________________________________________________________________
pred2_resize (Lambda)           (8, 128, 416, 1)     0           pred2_scale[0][0]                
__________________________________________________________________________________________________
up1_concat (Concatenate)        (8, 128, 416, 17)    0           up1_conv1[0][0]                  
                                                                 pred2_resize[0][0]               
__________________________________________________________________________________________________
up1_conv2 (Conv2D)              (8, 128, 416, 16)    2464        up1_concat[0][0]                 
__________________________________________________________________________________________________
pred1_conv (Conv2D)             (8, 128, 416, 1)     145         up1_conv2[0][0]                  
__________________________________________________________________________________________________
input_2 (InputLayer)            [(8, 3, 3)]          0                                            
__________________________________________________________________________________________________
pred1_scale (Lambda)            (8, 128, 416, 1)     0           pred1_conv[0][0]                 
==================================================================================================
Total params: 31,596,900
Trainable params: 31,596,900
Non-trainable params: 0
__________________________________________________________________________________________________

